app/controllers/devices_controller.rb

SELECT "devices".* FROM "devices" WHERE "devices"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def show
    @device = Device.find(params[:id])

SELECT "devices".* FROM "devices" WHERE "devices"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def edit
    @device = Device.find(params[:id])

INSERT INTO "devices" ("created_at", "description", "name", "type", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", Sat, 24 Nov 2012 19:31:13 UTC +00:00], ["description", "downstairs printer"], ["name", "Canon MX860"], ["type", "Printer"], ["updated_at", Sat, 24 Nov 2012 19:31:13 UTC +00:00]]
---
  def create
    @device = Device.new(params[:device])

    respond_to do |format|
      if @device.save

SELECT "devices".* FROM "devices" WHERE "devices"."id" = $1 LIMIT 1  [["id", "1"]]
UPDATE "devices" SET "location" = 'family room', "device_type" = 'printer', "updated_at" = '2012-11-25 03:40:39.756103' WHERE "devices"."id" = 1
---
  def update
    @device = Device.find(params[:id])

    respond_to do |format|
      if @device.update_attributes(params[:device])