app/controllers/macs_controller.rb

SELECT "macs".* FROM "macs"
---
  def index
    @macs = Mac.all

SELECT "macs".* FROM "macs" WHERE "macs"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def show
    @mac = Mac.find(params[:id])

SELECT "macs".* FROM "macs" WHERE "macs"."id" = $1 LIMIT 1  [["id", "11"]]
---
  def edit
    @mac = Mac.find(params[:id])

INSERT INTO "macs" ("address", "created_at", "description", "name", "owner", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    @mac = Mac.new(params[:mac])

    respond_to do |format|
      if @mac.save

SELECT "macs".* FROM "macs" WHERE "macs"."id" = $1 LIMIT 1  [["id", "11"]]
UPDATE "macs" SET "address" = '00:24:D7:0A:F2:C0', "description" = 'Lenovo ThinkPad T410', "name" = 'mmtp', "updated_at" = '2012-11-21 05:09:57.868951' WHERE "macs"."id" = 10
---
  def update
    @mac = Mac.find(params[:id])

    respond_to do |format|
      if @mac.update_attributes(params[:mac])