app/controllers/routers_controller.rb

  def index
    @routers = Router.all
---
SELECT "routers".* FROM "routers"

  def show
    @router = Router.find(params[:id])
---
SELECT "routers".* FROM "routers" WHERE "routers"."id" = $1 LIMIT 1  [["id", "1"]]

  def edit
    @router = Router.find(params[:id])
---
SELECT "routers".* FROM "routers" WHERE "routers"."id" = $1 LIMIT 1  [["id", "1"]]

  def create
    @router = Router.new(params[:router])

    respond_to do |format|
      if @router.save
---
INSERT INTO "routers" ("address", "created_at", "password", "updated_at", "username", "wired", "wireless") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def update
    @router = Router.find(params[:id])

    respond_to do |format|
      if @router.update_attributes(params[:router])
---
SELECT "routers".* FROM "routers" WHERE "routers"."id" = $1 LIMIT 1  [["id", "1"]]
UPDATE "routers" SET "password" = '', "location" = 'basement', "model" = 'Verizon', "description" = 'wireless-disabled', "updated_at" = '2012-11-24 19:15:57.528664' WHERE "routers"."id" = 1